INSERT INTO "manager_of_hse"
---------------------------------------------
("id", "name" , "surname","position"         ) VALUES
---------------------------------------------
(1,'Иван' , 'Иванов' , 'Начальник отдела ОТ' ),
(2,'Петр' , 'Петров' , 'Инженер отдела ОТ'   ),
(3,'Юрий' , 'Сидоров', 'Начальник участка'   );
SELECT setval('manager_of_hse_seq',         3);

INSERT INTO "instruction_type"
----------------------------------
("id", "name"                     ) VALUES
----------------------------------
(1   , 'Должностные'              ),
(2   , 'По охране труда'           ),
(3   , 'По работе на оборудовании'),
(4   , 'Карты техпроцесса'        );
SELECT setval('instruction_type_id_seq', 4);

INSERT INTO "instruction"
---------------------------------------------------------------------------------------------------------------------------------
("serial_number", "instruction_type_id", "name"                      , "date_of_creation" , "expiration_date" , "filename"        ) VALUES
---------------------------------------------------------------------------------------------------------------------------------
(9              , 2                    , 'Для каменщика'             , '02.01.2020'       , '02.01.2023'      , '9masons.pdf'     ),
(40             , 2                    , 'По оказанию первой помощи' , '25.11.2019'       , '25.11.2022'      , '40firstaid.pdf'  ),
(3              , 1                    , 'Начальника цеха'           , '25.11.2017'       , '25.11.2022'      , 'Foreman.docx'    ),
(24             , 2                    , 'По пожарной безопасности'  , '11.05.2018'       , '11.05.2021'      , '24firesafety.pdf');



INSERT INTO "workers_personal_card"
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
("id","personnel_number", "name"    , "surname"     , "work_area" , "position"           , "date_of_briefing" , "briefing_type" , "serial_number_id" , "manager_of_hse_id" ) VALUES
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
(1   ,100               ,'Владимир' , 'Мальгин'     , 'ЦПП'       , 'слесарь-сборщик СК' , '02.01.2020'       , 'вводный'       ,  1                 ,  3                   ),
(2   ,101               ,'Сергей'   , 'Ковалёв'     , 'ЦПП'       , 'слесарь-сборщик СК' , '02.01.2020'       , 'вводный'       ,  2                 ,  3                   ),
(3   ,102               ,'Евгений'  , 'Вертелко'    , 'ЦПП'       , 'слесарь-сборщик СК' , '02.01.2020'       , 'вводный'       ,  3                 ,  3                   ),
(4   ,103               ,'Михаил'   , 'Майоров'     , 'ЦПП'       , 'газоэлектросварщик' , '02.01.2020'       , 'вводный'       ,  1                 ,  3                   ),
(5   ,104               ,'Алексей'  , 'Барановский' , 'ЦПП'       , 'жестянщик'          , '02.01.2020'       , 'вводный'       ,  1                 ,  3                   );
SELECT setval('workers_personal_card_id_seq', 5);

INSERT INTO "briefing_type"
----------------------------------
("id", "name"                     ) VALUES
----------------------------------
(1   , 'Вводный'                  ),
(2   , 'Первичный'                ),
(3   , 'Повторный'                ),
(4   , 'Внеплановый'              ),
(5   , 'Целевой'                  );
SELECT setval('instruction_type_id_seq', 5);


INSERT INTO "workflow_journal"
-----------------------------------------------------------------------------------------
( "instruction_id" ,"briefing_type_id", "workers_personal_card_id" , "briefing_date" ) VALUES
-----------------------------------------------------------------------------------------
( 1                , 1                , 1                          ,'02.01.2020'     ),
( 2                , 2                , 2                          ,'02.01.2020'     ),
( 1                , 3                , 3                          ,'02.01.2020'     ),
( 4                , 1                , 4                          ,'02.01.2020'     ),
( 1                , 1                , 5                          ,'02.01.2020'     );
SELECT setval('workflow_journal_seq', 5);


INSERT INTO "user"
--------------------------------------------
("id", "login"  , "password", "role") VALUES
--------------------------------------------
(1   , 'admin'   , 'admin'    , 0     ),
(2   , 'manager', 'manager' , 1     ),
(3   , 'client'   , 'client'    , 2    );
SELECT setval('user_id_seq', 3);


INSERT INTO "order_type"
----------------------------------
("id", "name"                     ) VALUES
----------------------------------
(1   , 'Приказ'                  ),
(2   , 'Предписание'                ),
(3   , 'Информационное письмо'                );
SELECT setval('order_type_id_seq', 3);


INSERT INTO "order"
---------------------------------------------------------------------------------------------------------------------------------------------------------
("id","serial_number", "order_type_id", "ordername"                         , "date_of_creation" , "expiration_date" , "filename"        , "executer_id"  ) VALUES
---------------------------------------------------------------------------------------------------------------------------------------------------------
(1,10                , 1              , 'О назначении ответственных'        , '02.01.2020'       , '12.01.2020'      , '9masons.pdf'     ,   2            ),
(2,20                , 2              , 'О гарантийном ремонте'             , '06.05.2020'       , '09.05.2020'      , '40firstaid.pdf'  ,   2            ),
(3,30                , 3              , 'О профилактике несчастных случаев' , '25.06.2020'       , '25.07.2020'      , 'Foreman.docx'    ,   1            ),
(4,40                , 1              , 'О работе в зимний период'          , '01.12.2019'       , '07.12.2020'      , '24firesafety.pdf',   2            );
SELECT setval('order_seq', 4);







INSERT INTO "category"
--------------------------
("id", "name"     ) VALUES
--------------------------
(1   , 'Для кухни'),
(2   , 'Для ванны');
SELECT setval('category_id_seq', 2);

INSERT INTO "product"
------------------------------------------------------------------------------
("id", "category_id" , "name"        , "price", "amount", "date"      ) VALUES
------------------------------------------------------------------------------
(1   , 1             , 'Ложка'       , 123    , 20      , '2020-03-13'),
(2   , 2             , 'Зубная щётка', 234    , 10      , '2020-03-13'),
(3   , 1             , 'Нож'         , 345    , 30      , '2020-03-13'),
(4   , 2             , 'Бритва'      , 456    , 5       , '2020-03-13');
SELECT setval('product_id_seq', 4);

INSERT INTO "bankaccounts"
------------------------------------------------------------------------------
("id", "accountnumber" , "accountbalance" ) VALUES
------------------------------------------------------------------------------
(1   , 1               , 1200             ),
(2   , 2               , 1300             ),
(3   , 3               , 1400             ),
(4   , 4               , 1500             );
SELECT setval('product_id_seq', 4);

